In [10]:
import pandas as pd
import numpy as np
import pyforest

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['Column1','Column2','Column3','Column4'])
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [13]:
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [15]:
df.iloc[0:3,1:4]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11

In [17]:
type(df.iloc[0:3,1:4])

pandas.core.frame.DataFrame

In [19]:
df.to_csv("example1.csv")

In [24]:
df1=pd.read_csv("example1.csv")
df1.head()
print(df1)

  Unnamed: 0  Column1  Column2  Column3  Column4
0       Row1        0        1        2        3
1       Row2        4        5        6        7
2       Row3        8        9       10       11
3       Row4       12       13       14       15
4       Row5       16       17       18       19

In [28]:
df2=pd.read_csv("test1.csv")
df2.head()

     Name  Age     Occupation     Address
0   Akhil   27            VIP      Kannur
1    Ancy   26            VIP  Trivandrum
2  Murali   58  Retired Staff      Kannur
3  Anitha   52     House Wife      Kannur

In [30]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [32]:
df1

  Unnamed: 0  Column1  Column2  Column3  Column4
0       Row1        0        1        2        3
1       Row2        4        5        6        7
2       Row3        8        9       10       11
3       Row4       12       13       14       15
4       Row5       16       17       18       19

In [34]:
df2

     Name  Age     Occupation     Address
0   Akhil   27            VIP      Kannur
1    Ancy   26            VIP  Trivandrum
2  Murali   58  Retired Staff      Kannur
3  Anitha   52     House Wife      Kannur

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  5 non-null      int32
 1   Column2  5 non-null      int32
 2   Column3  5 non-null      int32
 3   Column4  5 non-null      int32
dtypes: int32(4)
memory usage: 292.0+ bytes

In [38]:
df2.describe()

             Age
count   4.000000
mean   40.750000
std    16.640813
min    26.000000
25%    26.750000
50%    39.500000
75%    53.500000
max    58.000000

In [13]:
from io import StringIO, BytesIO
data=('a,b,c\n''x,y,1\n''a,b,2\n''c,d,3\n')
akhi=pd.read_csv(StringIO(data),dtype={'col1':object,'col2':object ,'col3':int})
akhi.head()

   a  b  c
0  x  y  1
1  a  b  2
2  c  d  3

In [14]:
data1=('a,b,c\n' '4,akhi,knr\n' '8,ancy,tvm\n' '12,sukumar,knr\n')
pd.read_csv(StringIO(data1))

    a        b    c
0   4     akhi  knr
1   8     ancy  tvm
2  12  sukumar  knr

#### df.head() and df.tail():

In [15]:
#df.head will print the first five rows of the data frame
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [17]:
#passing a value inside the paranthesis will print that particular no of rows
df.head(2)

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7

In [19]:
#df.tail() will display the last five rows of the data frame
df.tail()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [20]:
#by passing a value through the paranthesis you can display a particular number of rows
df.tail(3)

      Column1  Column2  Column3  Column4
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19